tap "felixkratz/formulae"
tap "gromgit/fuse"
tap "narugit/tap"
tap "nikitabobko/tap"
brew "argocd"
brew "pkgconf"
brew "cmake"
brew "colima"
brew "coreutils"
brew "cypher-shell"
brew "docker"
brew "docker-compose"
brew "fastfetch"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gemini-cli"
brew "git"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnupg"
brew "go"
brew "googletest"
brew "graphviz"
brew "helm"
brew "htop"
brew "jenv"
brew "jq"
brew "kubernetes-cli"
brew "librealsense"
brew "make"
brew "maven"
brew "neovim"
brew "opencv"
brew "openjdk@17"
brew "protobuf"
brew "python@3.10"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "sshpass"
brew "starship"
brew "stow"
brew "uv"
brew "volta"
brew "wget"
brew "yq"
brew "zellij"
brew "felixkratz/formulae/borders"
brew "gromgit/fuse/sshfs-mac"
brew "narugit/tap/smctemp"
cask "nikitabobko/tap/aerospace"
cask "bruno"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "gcloud-cli"
cask "ghostty"
cask "istat-menus"
cask "macfuse"
cask "prismlauncher"
cask "sf-symbols"
cask "temurin"
cask "temurin@21"
cask "visual-studio-code"
vscode "1yib.rust-bundle"
vscode "andenetalexander.vim-cheatsheet"
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "dustypomerleau.rust-syntax"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "jinxdash.prettier-rust"
vscode "kevinrose.vsc-python-indent"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/wailsapp/wails/v2/cmd/wails"
cargo "evcxr_jupyter"
cargo "rustlings"
